"""Задача 1"""
# Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные,
# выведите на экран.
a1 = 10
a2 = 5
b = [1, 2, 3]
print(a1, a2)
print(a1, ',', b)

c = 8
d = c
f = 8
c1 = [1, 3, 6]
f1 = [1, 3, 6]
print(d is c)
print(f is c)
print(f1 is c1)
print(type(d))

x = ['2', 4]
y = (x[1], x[0])
z = {'key': y[0]}
print(f'{x}, {z}, {y}')

a = int(input('Ведите число:'))
print(a)
text = input('Ведите текст:')
print(text)

n1 = int(input('Ведите первое число:'))
n2 = int(input('Ведите второе число:'))
n3 = int(input('Ведите третье число:'))
print(f"Вы ввели: {n1}, {n2} и {n3}")

word1 = input('Ведите первую строку:')
word2 = input('Ведите вторую строку:')
print(f"Текст:{word1} {word2}")
