"""Задача 5"""


# Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор
# натуральных чисел. У пользователя необходимо запрашивать новый элемент
# рейтинга. Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например,
# my_list = [7, 5, 3, 3, 2].

arr = [7, 5, 3, 3, 2]
n = int(input('Введите число: '))
if n in arr:
    arr.insert(arr.index(n), n)
    print(arr)
elif n not in arr and n > arr[0]:
    arr.insert(0, n)
    print(arr)
elif n not in arr and n < arr[-1]:
    arr.append(n)
    print(arr)
